# Setup and Imports

In [1]:
#imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import os, json, math, time
import tmdbsimple as tmdb
from tqdm.notebook import tqdm_notebook

import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
#load the basics and ratings dataframes from the data folder
basics = pd.read_csv('Data/title_basics.csv.gz')
ratings = pd.read_csv('Data/title_ratings.csv.gz')
tmdb = pd.read_csv('Data/tmdb_results_combined.csv.gz')

# Part 3 - Create SQL Database

## Transformation

Required Transformation steps:

    Normalize Genre:
        Convert the single string of genres from title basics into 2 new tables.

            title_genres: with the columns:
                tconst
                genre_id

            genres:
                genre_id
                genre_name

    Discard unnecessary information:
        For the title basics table, drop the following columns:
            "original_title" (we will use the primary title column instead)
            "isAdult" ("Adult" will show up in the genres so this is redundant information).
            "titleType" (every row will be a movie).
            "genres" and other variants of genre (genre is now represented in the 2 new tables described above.
        Do not include the title_akas table in your SQL database.
            You have already filtered out the desired movies using this table and the remaining data is mostly nulls and not of-interest to the stakeholder.

#### Creating new tables

Creating list of unique genres

In [3]:
#create new column for the list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"
...,...,...,...,...,...,...,...,...,...,...
81772,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama,[Drama]
81773,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
81774,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
81775,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
81776,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"

In [4]:
#first, convert the column of strings to a list of strings for each row
split_genres = basics['genres'].str.split(',')
split_genres

0           [Comedy, Fantasy, Romance]
1                              [Drama]
2                              [Drama]
3             [Comedy, Horror, Sci-Fi]
4            [Horror, Music, Thriller]
                     ...
81772                          [Drama]
81773         [Comedy, Drama, Fantasy]
81774                          [Drama]
81775    [Action, Adventure, Thriller]
81776                 [Drama, History]
Name: genres, Length: 81777, dtype: object

In [5]:
#next, use .explode to create an array of all unique genre names
unique_genres = sorted(split_genres.explode().unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

Create new genres table

In [6]:
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
81775,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Action
81775,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Adventure
81775,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Thriller
81776,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
81776,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [7]:
#save tconst and genre_split columns
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [8]:
#make the mapper dictionary for genres
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [9]:
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')
title_genres

          tconst  genre_id
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0062336         7
2      tt0069049         7
...          ...       ...
81775  tt9916190         0
81775  tt9916190         2
81775  tt9916190        23
81776  tt9916362         7
81776  tt9916362        11

[152705 rows x 2 columns]

In [10]:
#convert genre map into a dataframe to servce as the genres table
genre_lookup = pd.DataFrame({'Genre_Name': genre_map.keys(),
                            'Genre_ID': genre_map.values()})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [11]:
#drop the unneccesary columns from the basics dataframe
basics = basics.drop(columns = ['originalTitle', 'isAdult', 'titleType', 'genres','genres_split'])
basics

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70
2,tt0069049,The Other Side of the Wind,2018,NaN,122
3,tt0088751,The Naked Monster,2005,NaN,100
4,tt0093119,Grizzly II: Revenge,2020,NaN,74
...,...,...,...,...,...
81772,tt9914942,Life Without Sara Amat,2019,NaN,74
81773,tt9915872,The Last White Witch,2019,NaN,97
81774,tt9916170,The Rehearsal,2019,NaN,51
81775,tt9916190,Safeguard,2020,NaN,90
81776,tt9916362,Coven,2020,NaN,92

## SQL table creation



    Use sqlalchemy with pandas to execute your SQL queries inside your notebook.

    Create a new database on your MySQL server and call it "movies".

    Make sure to have the following tables in your "movies" database:
        title_basics
        title_ratings
        title_genres
        genres
        tmdb_data

    Make sure to set a Primary Key for each table that isn't a joiner table (e.g. title_genres is a joiner table).

    After creating each table, show the first 5 rows of that table using a SQL query.

    Make sure to run the "SHOW TABLES" SQL query at the end of your notebook to show that all required tables have been created.

In [12]:
#load sql credentials
with open('/Users/wombatmaster/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['user', 'pass'])

In [13]:
# sqlalchemy connection to database
connection_str  = f"mysql+pymysql://{login['user']}:{login['pass']}@localhost/movies"
engine = create_engine(connection_str)

In [14]:
#check for database, create if needed
if database_exists(connection_str) == False: 
    create_database(connection_str)
else: 
    print('This database already exists.')

This database already exists.

In [15]:
#we need to create a datatype schema so that we can use strings as primary keys in sql
from sqlalchemy.types import *
#max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
#schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [16]:
#save dataframes as sql tables with dtype schema and index=False
basics.to_sql('title_basics', engine, dtype=df_schema, if_exists='replace', index=False)
ratings.to_sql('title_ratings', engine, dtype=df_schema, if_exists='replace', index=False)
title_genres.to_sql('title_genres', engine, dtype=df_schema, if_exists='replace', index=False)
genre_lookup.to_sql('genres', engine, dtype=df_schema, if_exists='replace', index=False)
tmdb.to_sql('tmdb_data', engine, dtype=df_schema, if_exists='replace', index=False)

328

In [17]:
#set the primary key columns with sqlalchemy
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_ID`);')

In [18]:
#query to display the newly created tabels
q= '''SHOW TABLES;'''

pd.read_sql(q,engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data